W14D3/BenchB&b/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "dQZcPLs_xEW4LqttgHQyzg"], ["updated_at", "2019-10-02 22:05:28.224463"], ["id", 5]]
---
    def reset_session_token
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save