W9D1/first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # render plain: "I'm in the index action!"
        users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        # render json: params
        user = User.find(params[:id])