W10D4/reddit_clone/app/views/posts/new.html.erb

    <label> Subs </label>
    <% Sub.all.each do |sub|%>
---
SELECT "subs".* FROM "subs"

                value="<%=sub.id%>"
                <%= "checked" if @post.sub_ids.include?(sub.id)%>
---
SELECT 1 AS one FROM "post_subs" WHERE "post_subs"."post_id" IS NULL AND "post_subs"."sub_id" = $1 LIMIT $2  [["sub_id", 1], ["LIMIT", 1]]