W9D2/art_share/art_share/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("created_at", "updated_at", "title", "artist_id", "img_url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-27 20:08:26.772627"], ["updated_at", "2019-08-27 20:08:26.772627"], ["title", "Mountains"], ["artist_id", 18], ["img_url", "mountains.io"]]
---
  def create
    artwork = Artwork.new(artwork_params)

      if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "img_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "Hills"], ["img_url", "hills.io"], ["updated_at", "2019-08-27 20:05:30.650235"], ["id", 1]]
---
  def update
    artwork = Artwork.find(params[:id])
      if artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    artwork = Artwork.find(params[:id])

INSERT INTO "likes" ("likable_type", "likable_id", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["likable_type", "Artwork"], ["likable_id", 10], ["user_id", 33]]
---
  def like
    # debugger
    like = Like.new(likable_type: :Artwork, likable_id: params[:id], user_id: params[:user_id])
    if like.save