W9D2/art_share/art_share/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        comment = Comment.find(params[:id])

INSERT INTO "likes" ("likable_type", "likable_id", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["likable_type", "Comment"], ["likable_id", 1], ["user_id", 33]]
---
    def like
        like = Like.new(likable_type: :Comment, likable_id: params[:id], user_id: params[:user_id])
    if like.save