W9D2/art_share/art_share/app/controllers/users_controller.rb

    def index
        # render plain: "I'm in the index action!"

        if params[:username]
            user = User.find_by(username: params[:username])
            render json: user
        else
            users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "alex4"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

    def show
        # render json: params
        user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]